src/Documents/ДокументЕРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДокументЕРП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЕРП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НВД_ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/HTTPServices/Mark/Ext/Module.bsl
Функция ПолучитьМаркиGet(Запрос)
	Ответ = Новый HTTPСервисОтвет(200); 
	ИДДок = Запрос.ПараметрыURL.Получить("ИДДок");
     
    Если ИДДок = Неопределено Тогда 
        Ответ = Новый HTTPСервисОтвет(400);
        Ответ.УстановитьТелоИзСтроки("Не задан ГУИД документа");
        Ответ.Заголовки.Вставить("Content-Type","application/json");
        Возврат Ответ;
	КонецЕсли; 
	
    СтрокаJSON = СписокМарок(ИДДок);
    Ответ.УстановитьТелоИзСтроки(СтрокаJSON); 
    Ответ.Заголовки.Вставить("Content-Type","application/json");
    Возврат Ответ;
КонецФункции       

Функция СписокМарок(ИДДок) Экспорт
     
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ЕСТЬNULL(МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода, """") КАК Марка,
    |	ЕСТЬNULL(МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура.ИдЕРП, """") КАК НоменклатураИдЕРП
    |ИЗ
    |	Документ.ДокументЕРП.НВД_ШтрихкодыУпаковок КАК МаркиДокументаЕРПНВД_ШтрихкодыУпаковок
    |ГДЕ
    |	МаркиДокументаЕРПНВД_ШтрихкодыУпаковок.Ссылка.ИдЕРП = &ИдЕРП";
     
	Запрос.Параметры.Вставить("ИдЕРП",ИДДок);
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Массив = Новый Массив;
    Структура = Новый Структура("Марка, ИдНоменклатура");
	Пока Выборка.Следующий() Цикл       
    	Структура = Новый Структура("Марка, ИдНоменклатура");
        Структура.Марка = Выборка.Марка; 
		Структура.ИдНоменклатура = Выборка.НоменклатураИдЕРП;
        Массив.Добавить(Структура);
    КонецЦикла;
     
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Массив);
     
    СтрокаJSON = ЗаписьJSON.Закрыть();
    Возврат СтрокаJSON;
     
КонецФункции
